<?php
/**
 * Created by PhpStorm.
 * User: masood
 * Date: 11/22/18
 * Time: 1:43 PM
 */

namespace itsmh\yii2payamresan\exception;


use Throwable;
use yii\base\Exception;

class sendException extends Exception
{

    public function __construct($message = "", $code = 0, Throwable $previous = null)
    {
        parent::__construct($message, $code, $previous);
        $this->message = $this->_errorList[$message];

    }

    private $_errorList = [
        "-1" => "نام کاربري يا کلمه عبور وارد شده اشتباه است.",
        "-2" => "ارسال از طريق وب سرويس براي اين کاربر غیر فعال است.",
        "-3" => "سرويس موقتا غیر فعال است.",
        "-4" => "شماره فرستنده متعلق به اين کاربر نیست.",
        "-5" => "شماره تلفن همراه گیرنده اشتباه است.",
        "-6" => "اعتبار کاربر براي ارسال کافي نیست.",
        "-7" => "آرايه گیرندگان خالي است.",
        "-8" => "تعداد شماره هاي گیرنده موجود در آرايه بیشتر از تعداد مجاز است.",
        "-9" => "شماره فرستنده اشتباه است.",
        "-10" => "آرايه شناسه پیام خالي است .",
        "-11" => "حساب کاربر مسدود است .",
        "-12" => "تلفن همراه کاربر فعال نیست . )بايد با ورود به سامانه مراحل فعال سازي را طي کنید(",
        "-13" => "ايمیل کاربر فعال نیست . )بايد با ورود به سامانه مراحل فعال سازي را طي کنید(",
        "-14" => "شماره اختصاصي گیرنده پیام اشتباه است.",
        "-15" => "تعداد پیامک هاي درخواستي خارج از محدوده مجاز است .",
        "-16" => "تاخیر مجاز بايد يک عدد بین 0 تا 24 باشد .",
        "-18" => "متن پیام اشتباه است.",
        "-19" => "تعداد خانه هاي آرايه متن بايد برابر 1 يا به تعداد خانه هاي آرايه دريافت کننده باشد.",
        "-20" => "تعداد خانه هاي آرايه فرستنده بايد برابر 1 يا به تعداد خانه هاي آرايه دريافت کننده باشد.",
        "-21" => "تعداد خانه هاي آرايه تاخیر مجاز بايد برابر 1 يا به تعداد خانه هاي آرايه دريافت کننده باشد.",
        "-30" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-31" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-32" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-33" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-34" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-35" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-36" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-37" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-38" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-39" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
        "-40" => "خطاي داخلي ،درخواست مجددا ارسال شود .",
    ];

    public function getName()
    {
        return "Send SMS";
    }

    /**
     * @param mixed $message
     */
    public function setMessage($message)
    {
        $this->message = $this->_errorList[$message];
    }

    /**
     * @param mixed $code
     */
    public function setCode($code)
    {
        $this->code = $code;
//        $this->message = $this->_errorList[$code];
    }


}
